Revit 2026 API

# RevitLinkTypeSavePositions Method

---

Saves shared coordinates changes back to the linked document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SavePositions(
	ISaveSharedCoordinatesCallback callback
)
```
```vb
Public Function SavePositions (
	callback As ISaveSharedCoordinatesCallback
) As Boolean
```
```cpp
public:
bool SavePositions(
	ISaveSharedCoordinatesCallback^ callback
)
```
```fsharp
member SavePositions :
        callback : ISaveSharedCoordinatesCallback -> bool
```

#### Parameters

callback ISaveSharedCoordinatesCallback
     A callback object to resolve situations when Revit encounters modified links.

#### Return Value

Boolean True if we saved the link or if there were no changes to save. False if the operation failed.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Revit could not save shared coordinates changes to the link or one of its nested links. |

While this operation does not clear the document's undo history, you will not be able to undo this specific action, since it saves the link's shared coordinates changes to disk.

#### Reference

RevitLinkType Class

Autodesk.Revit.DB Namespace